return {
    {
        "folke/snacks.nvim",
        lazy = true,
        opts = {
            dashboard = {
                enabled = true,
                preset = {
                    header = [[
  ███╗   ██╗███████╗ ██████╗ ██╗   ██╗██╗███╗   ███╗
  ████╗  ██║██╔════╝██╔═══██╗██║   ██║██║████╗ ████║
  ██╔██╗ ██║█████╗  ██║   ██║██║   ██║██║██╔████╔██║
  ██║╚██╗██║██╔══╝  ██║   ██║╚██╗ ██╔╝██║██║╚██╔╝██║
  ██║ ╚████║███████╗╚██████╔╝ ╚████╔╝ ██║██║ ╚═╝ ██║
  ╚═╝  ╚═══╝╚══════╝ ╚═════╝   ╚═══╝  ╚═╝╚═╝     ╚═╝
                    ]],
                },
                sections = {
                    { section = "header" },
                    {
                        section = "keys",
                        gap = 1,
                        padding = 1,
                    },
                    {
                        icon = " ",
                        title = "Recent Files",
                        section = "recent_files",
                        indent = 2,
                        padding = 1,
                    },
                    {
                        icon = " ",
                        title = "Last Session",
                        section = "session",
                        indent = 2,
                        padding = 1,
                    },
                    { section = "startup" },
                },
            },
        },
    },
}
